# SetAnalyzeAs Method (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
AnalyticalModel..::..SetAnalyzeAs Method
AnalyticalModel Class See Also
---
Sets value of Analyze As parameter for this Element.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2011
# Syntax
C#
---
```text
public void SetAnalyzeAs(
	AnalyzeAs analyzeAs
)
```

Visual Basic
---
```text
Public Sub SetAnalyzeAs ( _
	analyzeAs As AnalyzeAs _
)
```

Visual C++
---
```text
public:
void SetAnalyzeAs(
	AnalyzeAs analyzeAs
)
```

# ### Parameters
analyzeAs
    Type: Autodesk.Revit.DB.Structure..::..AnalyzeAs Indicates how Analytical Model is analyzed .
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | analyzeAs is invalid for analytical model. |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also
AnalyticalModel Class
Autodesk.Revit.DB.Structure Namespace